"""客第壹-相关"""
ApiXfpUrl = 'http://xfpapi.ykb100.com'
ApiXfpUrl1 = 'http://xfpapiweb.ykb100.com'
XfpUser = '13062200301'
XfpPwd = '12345678'
XfpsaasCode = '000009'
XfpUser1 = '13062200304'
XfpUser11 = '13062200311'
XfpPwd1 = '12345678'


# ApiXfpUrl = 'http://xfp.xfj100.com'
# ApiXfpUrl1 = 'https://xfpapi.xfj100.com'
# XfpUser = '19859080323'
# XfpPwd = '12345678'
# XfpsaasCode = 'test'
# XfpUser1 = '19859080301'
# XfpPwd1 = '12345678'


# ApiXfpUrl = 'http://192.168.10.96:8381'
# ApiXfpUrl1 = 'http://192.168.10.52/xfp_api'
# XfpUser = '13062200301'
# XfpPwd = '12345678'
# XfpsaasCode = '000009'
# XfpUser1 = '13062200304'
# XfpPwd1 = '12345678'

# 设备ID
deviceId = '8643960424482917'

surname = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩',
           '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏',
           '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚',
           '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
           '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗',
           '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余',
           '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁',
           '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞']

PassWord = "nighqgkwmdkrbgic"