"""配置文件"""
ApiLoninUrl = 'http://192.168.10.22:8085'
ApiNewsUrl = 'http://push.ykb100.com/interface.do?command=getPushNotificationsList'
# ApiAgentUrl = 'http://192.168.10.94:9090'
ApiAgentUrl = 'http://192.168.10.94:9090'
ApiXmUrl = "http://192.168.10.123:9090"
PushUrl = 'http://192.168.10.22:8084'
"""幸福派相关"""
ApiXfpUrl = 'http://192.168.50.16:8381'
XfpUser = '19859080323'
XfpPwd = '123456789'
XfpsaasCode = '88888888'
"""幸福客登录账号、密码、售楼员昵称"""
XfkUser = '17605087327'
XfkPwd = '123456'
XfkSalesName = '用户7327'
"""城市ID  报名手机号前缀"""
cityId = '756'
cityName = '珠海'
CityName = '幸福家股份[珠海]'
PhoneFront = "188888"

"""经纪人登录账号、密码、项目名称"""
AgentUesr = '17605087327'
AgentPwd = '123456'
ProjectName = '潘测试皇爵商业广场'
agentUid = '7C5AAF26-2CF6-4EF1-9BDE-D278D5563C7B'
citySiteId = '1'

"""主要经纪人手机号码"""
# 异地A队长、A队员 、C队长 、C队员
AgentUser1 = '13062200301'
AgentUser2 = '13062200302'
AgentUser3 = '13062200303'
AgentUser4 = '13062200304'
# 本地A队长 A队员 C队长 C队员
AgentUser5 = '13062200305'
AgentUser6 = '13062200306'
AgentUser7 = '13062200307'
AgentUser8 = '13062200308'
# 默认团队
AgentUser9 = '13062200309'
# 图片
img = '/uploads/2019/0930/1f62b001-2547-4193-a1e8-1d695790f4c4.png'

"""小秘登录账号、密码、联盟商名称、"""
XmUser = "17605080002"
XmPwd = "123456"
XmSellerName = '嘀～嘀嘀'

"""幸福盟路径、登录队长账号、密码"""
XfmUrl = "http://192.168.10.188:9092"
XfmBossUser = "13332978076"
XfmBossPwd = "123456"

"""城市站路径、登录账号、密码"""
CityUrl = "http://192.168.10.188:9091"
CityUser = "17605087327"
CityPwd = "123456"

"""总站路径、登录账号、密码"""
AdminUrl = "http://192.168.10.188:8081"
AdminUser = "17605087327"
AdminPwd = "123456"

"""内容过长512个字"""
ContentLong = "60歲，辛苦了一輩子，想出去走走 身邊的那個人過了30年 " \
              "你依舊分不清到底喜不喜歡 你們開始規劃旅遊路線 這麼多年了 " \
              "你們還是存在分歧，還是在爭吵 某個瞬間，你覺得 這樣可能也挺好 " \
              "一切都準備好了 兒子說：爸媽，我工作太忙了 可以幫我照顧一下孩子么 " \
              "你們退了機票，又回到了30年前70歲，孩子的孩子也長大了， 不用天天操心了  " \
              "你下定決心說：一定要去玩一趟  可是手邊的拐杖  只能支持你走到樓下的花園 75歲，" \
              "你在醫院的病床上  身邊聚滿了人， 你迷迷糊糊的看見醫生搖了搖頭  周圍那些人神情肅穆  " \
              "你明白了，你要死掉了  你沒有感到一絲害怕  你突然問自己， 我到底是什麼時候死掉的呢？  " \
              "你想起來30歲的那場婚禮  原來，那時候，你就死掉了吧  依照慣例 死前的3秒， " \
              "你的大腦要走馬燈 倒敘你這75個年頭的一生 畫面一張一張的過  1秒 2秒 兩秒過去了 " \
              "你面無表情的看著這兩秒內的回憶  第3秒 突然你笑了  " \
              "原來已經回到了15歲的那一年你看見一個男孩 " \
              "他叼著一袋牛奶， 背著書包 從另一個女孩家的陽台下跑過 那個男孩朝窗戶里看了看  " \
              "那是15歲的你暗戀的那個女孩子  你想不起來她長什麼樣子了  " \
              "最後一秒你努力的回憶著  然後終於笑了出來  3秒過去了 " \
              "身邊的人突然間開始嚎啕大哭 你可能聽不清了  " \
              "你最後聽到的嘈雜的聲音  是一群十五六的少年  起著哄說的 答應他 答應他 答應他"
