"""
问题--简单的自我介绍
·分析:我们得先了解考官想要获取什么信息呢?
 从业时间、教育背景、工作经验、项目经验、擅长技能、你的性格

实例:你好，我叫XX，16年从XXX学院计算机专业毕业，毕业至今在xXX公司从事软件测试工作2年。
    测试过大小项目5个，-个主要是家居定制整合平台系统，有web端跟app端，设计师可以发布作品，
    购买者可以选择发布订单，设计师接收订单这样的一个产品模式;在这个项目中我负责包括测试用例设计、
    接口测试、功能测试;还有一个是家校互动类系统，包括家校沟通、发布作业、上课点名、课程表，学校动态，
    个人动态这些，这个我独立负责完成，包括需求确定及分析、环境部署、测试案例设计、功能及性能测试具体执行、
    最后的文档归档测试工具除了基本的项目管理工具禅道、svn;
    其他使用比较多的是jmeter, fiddler也有过开发的经验，擅长Java. JavaScript编程语言 (有就写没有就不说)

    (我是一个耐心认真的人，有很大信心做好测试工作。)自我介绍大致就是这样， 谢谢

注：1、与个人简历相一致
    2、事先以文字形式写好念熟
    3、不熟悉的技能不要自我介绍挖坑
    4、提前了解对方公司情况，外资企业提前准备一份英文自我介绍
    5、陈述任何问题的时候，语速放慢，不容易紧张
"""

"""
问题--你们公司测试工作是怎么进行的?

      分析:考察是否熟悉测试过程中各个环节。你需要准备的知识点有:软件项目的生命周期、
      测试流程、软件质量保证、bug的生命周期等

      案例:我们会根据产品经理编写的需求规格说明书做测试需求分析(小组内做测试需求分析，有不懂的问产品经理) ,
      测试经理制定测试计划(测试分组，测试模块分工，测试时间以及进度安排) ,各成员分别写用例，
      用例编写完成先小组内审核用例，之后通过会议进行整个项目组的用例评审，等开发研发完毕，
      然后测试组介入测试，根据测试用例和功能分工任务来测试，测试的时候注意浏览器的兼性，执行过程发现缺陷，
      提交bug到缺陷管理平台，井对bug进行跟踪，直至缺陷率满足用户需求，到这里测试完成。最后对测试结果进行分析，
      写好测试报告，提交测试报告并通过运维发布，上线后，关注web是否正常运行。

      衍生问题:

      -bug的生命周期?
      -bug记录里面包含哪些内容?
      一提交了一 个bug.但开发认为不是bug,作为测试怎么办?
      一对于复现率不高的bug怎么处理? ---必须提交，写清楚详细信息并且写明偶先
      一有没有你印象深刻的bug? 问题的原因?
 
"""

